Repository: ArtushS/kidstel
Catalog: lib/l10n/app_*.arb
Languages: hy

source: Settings
hy: Կարգավորումներ

source: Appearance
hy: Տեսք

source: Theme
hy: Թեմա

source: Font size
hy: Տառաչափ

source: Animations
hy: Անիմացիաներ

source: Story preferences
hy: Պատմության նախընտրություններ

source: Language
hy: Լեզու

source: Generate
hy: Ստեղծել

source: Create new story
hy: Ստեղծել նոր հեքիաթ

source: Describe your idea
hy: Նկարագրիր գաղափարդ

# typeYourIdea
source: Type your idea or use voice…
hy: Գրիր գաղափարդ կամ օգտագործիր ձայնը…

source: Create Story
hy: Ստեղծել հեքիաթ

source: My Stories
hy: Իմ հեքիաթները

source: Hero
hy: Հերոս

source: Location
hy: Վայր

source: Swipe to choose
hy: Սահեցրու ընտրելու համար

# heroBear
source: Bear
hy: Արջ

# heroCat
source: Cat
hy: Կատու

# heroDog
source: Dog
hy: Շուն

# heroBoy
source: Boy
hy: Տղա

# heroGirl
source: Girl
hy: Աղջիկ

# reduceMotion
source: Reduce motion if disabled
hy: Նվազեցնել շարժումը եթե անջատված է

source: Age group
hy: Տարիքային խումբ

source: Story length
hy: Պատմության երկարությունը

source: Complexity
hy: Բարդություն

source: Default narration voice
hy: Հիմնական պատմող ձայն

source: Coming soon
hy: Շուտով

source: Audio
hy: Աուդիո

source: Voice narration
hy: Ձայնային պատում

source: Background music
hy: Ֆոնային երաժշտություն

source: Sound effects
hy: Ձայնային էֆեկտներ

source: Auto-play narration
hy: Ավտո-նվագարկել պատումը

source: Parental & Safety
hy: Ծնողական անվտանգություն

source: Safe mode
hy: Անվտանգ ռեժիմ

source: Restricts sensitive content
hy: Սահմանափակում է զգայուն բովանդակությունը

source: Disable scary content
hy: Անջատել սարսափելի բովանդակությունը

source: Require parent confirmation
hy: Պահանջել ծնողի հաստատումը

source: Before story generation
hy: Նախքան պատմության ստեղծումը

source: AI & Generation
hy: AI & Ստեղծում

source: Auto-generate illustrations
hy: Ավտո-ստեղծել նկարազարդումներ

source: Creativity level
hy: Ստեղծագործության մակարդակ

source: Remember preferences
hy: Հիշել նախընտրությունները

source: System
hy: Համակարգ

source: Reset settings
hy: Վերականգնել կարգավորումները

source: Back to defaults
hy: Վերադառնալ սկզբնական կարգավորումներին

# resetSettingsQuestion
source: Reset settings?
hy: Վերականգնե՞լ կարգավորումները

# restoreDefaultsMessage
source: This will restore all settings to default values.
hy: Սա վերականգնում է բոլոր կարգավորումները սկզբնական արժեքներին:

source: Cancel
hy: Չեղարկել

source: Reset
hy: Վերականգնել

# themeSystem
source: System
hy: Համակարգ

# themeLight
source: Light
hy: Լուսավոր

# themeDark
source: Dark
hy: Մութ

# fontSmall
source: Small
hy: Փոքր

# fontMedium
source: Medium
hy: Միջին

# fontLarge
source: Large
hy: Մեծ

# storyShort
source: Short
hy: Կարճ

# storyMedium
source: Medium
hy: Միջին

# storyLong
source: Long
hy: Երկար

# complexitySimple
source: Simple
hy: Պարզ

# complexityNormal
source: Normal
hy: Սովորական

# creativityLow
source: Low
hy: Ցածր

# creativityNormal
source: Normal
hy: Սովորական

# creativityHigh
source: High
hy: Բարձր

source: Account
hy: Հաշիվ

# storyGeneratedFromIdea
source: Story will be generated from your idea
hy: Պատմությունը կստեղծվի գաղափարից

# heroFox
source: Fox
hy: Աղվես

# heroRabbit
source: Rabbit
hy: Նապաստակ

# heroDice
source: Dice
hy: Զառ

# heroRandom
source: Random
hy: Պատահական

# locationCastle
source: Castle
hy: Ամրոց

# locationCozyCottage
source: Cozy cottage
hy: Հարմարավետ տնակ

# locationFloatingIsland
source: Floating island
hy: Լողացող կղզի

# locationSnowCastle
source: Snow castle
hy: Ձյունե ամրոց

# locationUnderwater
source: Underwater
hy: Ստորջրյա

# locationRandom
source: Random
hy: Պատահական

# randomLocationLabel
source: Random location
hy: Պատահական վայր

source: Story Type
hy: Պատմության տեսակ

# randomStyleLabel
source: Random style
hy: Պատահական ոճ

# typeFriendly
source: Friendly
hy: Ընկերական

# typeAdventure
source: Adventure
hy: Արկածային

# typeMagic
source: Magic
hy: Կախարդական

# typeFunny
source: Funny
hy: Զվարճալի

# typeRomantic
source: Romantic
hy: Ռոմանտիկ

source: Toggle dark mode
hy: Փոխել մութ ռեժիմը

source: Menu
hy: Ընտրացանկ

source: Voice input
hy: Ձայնային ներածում

# ttsSystemLabel
source: TTS: system
hy: TTS: համակարգ

# childNameLabel
source: Child name
hy: Երեխայի անունը

# childNameHint
source: Optional
hy: Ոչ պարտադիր

# heroNameLabel
source: Hero name
hy: Հերոսի անունը

# heroNameHint
source: Optional
hy: Ոչ պարտադիր

# heroNameHelper
source: If set, the story will use this name for the main hero.
hy: Եթե լրացնես, պատմության գլխավոր հերոսը կունենա այս անունը։

# voiceHelpTitle
source: Voice input help
hy: Ձայնային ներածման օգնություն

# voiceHelpSubtitle
source: Armenian voice input & languages
hy: Հայերեն ձայնային ներածում և լեզուներ

# voiceHelpArmenianTitle
source: Armenian voice input
hy: Հայերեն ձայնային ներածում

# voiceHelpStatusLabel
source: Supported on this device
hy: Աջակցվում է սարքում

# voiceHelpSupportedYes
source: Yes
hy: Այո

# voiceHelpSupportedNo
source: No
hy: Ոչ

# voiceHelpSupportedHint
source: Armenian voice input appears to be supported. Tap the mic and try a short phrase.
hy: Թվում է՝ հայերեն ձայնային ներածումը աջակցվում է։ Սեղմիր միկրոֆոնը և փորձիր կարճ արտահայտություն։

# voiceHelpSteps
source: Voice input depends on your phone's speech services and language settings. The app can't enable it automatically. Try: Settings → Language & input → Voice input (or Google voice typing) → Languages → enable Armenian.
hy: Ձայնային ներածումը կախված է հեռախոսի խոսքի ծառայություններից և լեզվի կարգավորումներից։ Հավելվածը չի կարող դա միացնել ավտոմատ։ Փորձիր՝ Կարգավորումներ → Լեզու և ներածում → Ձայնային ներածում (կամ Google ձայնային ներածում) → Լեզուներ → միացրու Հայերեն։

# voiceNotAvailable
source: Voice input not available
hy: Ձայնային ներածումը հասանելի չէ

# voiceNotAvailableHyMessage
source: Armenian speech recognition is not supported on this device. You can still type Armenian with the keyboard and it will be sent to AI.
hy: Հայերեն խոսքի ճանաչումը չի աջակցվում այս սարքում։ Դու կարող ես հայերեն մուտքագրել ստեղնաշարով, և տեքստը կուղարկվի AI-ին։

# voiceHelpWhatIsThis
source: What is this?
hy: Ի՞նչ է սա

source: Open settings
hy: Բացել կարգավորումները

# openSettingsManually
source: Open settings manually: Settings → Language & input → Voice input
hy: Բացիր կարգավորումները ձեռքով․ Կարգավորումներ → Լեզու և ներածում → Ձայնային ներածում

source: Try again
hy: Փորձել նորից

source: Close
hy: Փակել

source: Generate request (MVP)
hy: Ստեղծման հարցում (MVP)

source: Generating…
hy: Ստեղծում…

# generationFailedTitle
source: Generation failed
hy: Ստեղծումը չհաջողվեց

# sttNoResults
source: Speech recognition produced no results
hy: Ձայնի ճանաչումը արդյունք չտվեց

source: OK
hy: Լավ

source: Reading
hy: Ընթերցում

source: No story yet
hy: Դեռևս պատմություն չկա

# noStoryMessage
source: Tap "Create Story" on the main page to create a new story.
hy: Սեղմիր "Ստեղծել հեքիաթ" գլխավոր էջում՝ նոր հեքիաթ ստեղծելու համար:

source: Chapter 1
hy: Գլուխ 1

source: Choice (placeholder):
hy: Ընտրություն (ժամանակավոր):

source: Go left
hy: Գնալ ձախ

source: Go right
hy: Գնալ աջ

source: Stay
hy: Մնալ

source: Not found
hy: Չի գտնվել

source: Story
hy: Պատմություն

# chooseWhatNext
source: Choose what happens next:
hy: Ընտրիր՝ ինչ կլինի հետո․

# readAloud
source: Read
hy: Կարդալ

source: Pause
hy: Դադար

source: Resume
hy: Շարունակել

source: Start from…
hy: Սկսել այստեղից…

# stopReading
source: Stop
hy: Կանգնեցնել

source: Illustration
hy: Նկարազարդում

source: Save image
hy: Պահել պատկերը

source: Saved.
hy: Պահված է։

source: Failed to load image
hy: Չհաջողվեց բեռնել պատկերը

source: Enable Voice narration in Settings
hy: Միացրու ձայնային ընթերցումը Կարգավորումներում

source: Generate image
hy: Ստեղծել պատկեր

source: Retry
hy: Կրկին փորձել

source: Save to My Stories
hy: Պահել Իմ հեքիաթները

# interactiveStories
source: Enable interactive stories
hy: Միացնել ինտերակտիվ պատմությունները

# interactiveStoriesSubtitle
source: Show choices (up to 3 steps) to continue the story
hy: Ցուցադրել ընտրանքներ (մինչև 3 քայլ)՝ պատմությունը շարունակելու համար
